package core.four_oop.taskThree;
//3) Створити клас Тварина. Описати його такими полями: назва тварини , швидкість тварини, вік тварини.
// Дані поля помічені модифікатором доступу private.
//Створити конструктор з визначеними параметрами, в який необхідно ввести всі поля класу.
// Створити getters/setters до всіх полів класу. В методі мейн Створити екземпляр даного класу,
// за допомогою getter вивести на консоль в один рядок значення полів даного класу.
// Викликати setter, змінити значення всіх полів класу. Вивести на консоль всі поля класу, знову в один рядок.
// Значення полів довільні на Ваш розсуд. В методі мейн повинен бути створений лише один об`єкт класу Тварина.
// Вивід повинен бути написаний наступним чином:
//"Назва тварини = Леопард, Швидкість тварини = 20 км/год, Вік тварини = 7 років "
// "Назва тварини = Бик, Швидкість тварини = 2 км/год, Вік тварини = 14 років "
public class MainAnimal {
    public static void main(String[] args) {
        Animal animal = new Animal("Леопард ", 20, 7);

        animal.getInfo();

        animal.setName("Бик");
        animal.setSpeed(2);
        animal.setAge(14);

        animal.getInfo();
    }
}
