package core.third_oop.taskOne;
//Описати клас Rectangle , в якому буде описано поля : довжина, ширина. Описати дані поля в конструкторі.
//Створити конструктор з параметрами і без параметрів. В конструкторі без параметрів описати свої дані.
// Тобто створюючи об’єкт, за вибору даного конструктору, ви отримаєте прямокутник даного розміру.
// Написати методи, які будуть розраховувати площу та периметр. В Main класі продемонструвати створення
// об’єктів використовуючи два конструктори. Вивести на консоль площу і периметр прямокутника.
//Вивід на консолі повинен мати наступний вигляд: «Площа прямокутника = … », «Периметр прямокутника = … » .

public class RectangleMain {
    public static void main(String[] args) {
        Rectangle rectangle = new Rectangle(5.5, 2.0);
        Rectangle rectangle2 = new Rectangle();

        System.out.println("Конструктор з параметрами: ");
        rectangle.area();
        rectangle.perimeter();

        System.out.println("*************************");
        System.out.println("Конструктор без параметрів:");
        rectangle2.area();
        rectangle2.perimeter();
    }
}
